# Taps
tap "jesseduffield/lazydocker"
tap "oven-sh/bun"

# Formulae
brew "anomalyco/tap/opencode"
brew "cloc"
brew "cocoapods"
brew "curl"
brew "deno"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "imagemagick"
brew "jesseduffield/lazydocker/lazydocker"
brew "jq"
brew "lazygit"
brew "lua-language-server"
brew "mas"
brew "neovim"
brew "oven-sh/bun/bun"
brew "pnpm"
brew "poppler"
brew "rbenv"
brew "resvg"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "sevenzip"
brew "starship"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks
cask "1password"
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "iina"
cask "raycast"
cask "tailscale-app"
cask "yaak"

# Mac App Store
mas "TextSniper", id: 1528890965
